---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS
source: html/ecf2fec6-db48-e7e1-7900-851c419295e2.htm
---
# StructuralSectionRectangleHSS Properties

Common set of parameters for structural analysis.